Tekla Open API Reference for Tekla Structures 2025
View.RotateViewOnDrawingPlane Method
 Rotate the view on the drawings plane. This works just like the user interface command "Rotate view".
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RotateViewOnDrawingPlane(
	double rotationAngle
)
Public Function RotateViewOnDrawingPlane (
	rotationAngle As Double
) As Boolean
Parameters
rotationAngle
Type: System.Double
The amount of degrees to rotate the view with.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Drawing.View.RotateViewOnDrawingPlane(System.Double)"]
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace